Revit 2027 API
BuiltInFailures.JoinElementsFailures.WallTypeUnsupportedError Property
 The selected wall type/shape isn't supported for attaching a wall to a stair. To continue, detach the wall from the stairs' components.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WallTypeUnsupportedError { get; }
Public Shared ReadOnly Property WallTypeUnsupportedError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WallTypeUnsupportedError {
	FailureDefinitionId^ get ();
}
static member WallTypeUnsupportedError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace